local _ = { {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {} }
_[ 1][ 1] = { kind = "祝日", name = "元日" };
_[ 1][ 2] = { kind = "休日", name = "振替休日" };
_[ 1][ 9] = { kind = "祝日", name = "成人の日" };
_[ 2][11] = { kind = "祝日", name = "建国記念の日" };
_[ 3][20] = { kind = "祝日", name = "春分の日" };
_[ 4][29] = { kind = "祝日", name = "昭和の日" };
_[ 4][30] = { kind = "休日", name = "振替休日" };
_[ 5][ 3] = { kind = "祝日", name = "憲法記念日" };
_[ 5][ 4] = { kind = "祝日", name = "みどりの日" };
_[ 5][ 5] = { kind = "祝日", name = "こどもの日" };
_[ 7][16] = { kind = "祝日", name = "海の日" };
_[ 9][17] = { kind = "祝日", name = "敬老の日" };
_[ 9][22] = { kind = "祝日", name = "秋分の日" };
_[10][ 8] = { kind = "祝日", name = "体育の日" };
_[11][ 3] = { kind = "祝日", name = "文化の日" };
_[11][23] = { kind = "祝日", name = "勤労感謝の日" };
_[12][23] = { kind = "祝日", name = "天皇誕生日" };
_[12][24] = { kind = "休日", name = "振替休日" };
return _
